package com.company.Lesson21;

/**
 * Created by Mila on 4/20/2017.
 */
//        Задача: Пользователь вводит с клавиатуры список слов (и чисел). Слова вывести в возрастающем порядке, числа - в убывающем.
//        Пример ввода:
//        Вишня
//        1
//        Боб
//        3
//        Яблоко
//        2
//        0
//        Арбуз
//        Пример вывода:
//        Арбуз
//        3
//        Боб
//        2
//        Вишня
//        1
//        0
//        Яблоко

public class Test020 {
    public static void sort(String[] array){

    }

}

